<?xml version="1.0" encoding="windows-1252"?>
<XMI xmi.version="1.1" xmlns:UML="omg.org/UML1.3">
	<XMI.header><XMI.documentation><XMI.exporter>Enterprise Architect</XMI.exporter><XMI.exporterVersion>2.5</XMI.exporterVersion></XMI.documentation></XMI.header><XMI.content><UML:Model name="EA Model" xmi.id="MX_EAID_4640A444_F6FB_4c24_80CC_C482772111B6"><UML:Namespace.ownedElement><UML:Class name="EARootClass" xmi.id="EAID_11111111_5487_4080_A7F4_41526CB0AA00" isRoot="true" isLeaf="false" isAbstract="false"/><UML:Package name="2. Descrição geral do produto" xmi.id="EAPK_4640A444_F6FB_4c24_80CC_C482772111B6" isRoot="false" isLeaf="false" isAbstract="false" visibility="public"><UML:ModelElement.taggedValue><UML:TaggedValue tag="documentation" value="&lt;b&gt;2.1. Vis&amp;#227;o Geral&lt;/b&gt;&#xA;A cl&amp;#237;nica-escola do Departamento de Ensino de Odontologia oferece as disciplinas de pr&amp;#225;tica cl&amp;#237;nica (Cl&amp;#237;nica I, II e III), atendendo a comunidade durante o per&amp;#237;odo letivo. O fluxo de trabalho atual come&amp;#231;a quando um paciente procura o servi&amp;#231;o e &amp;#233; cadastrado em uma planilha eletr&amp;#244;nica compartilhada para triagem. Ap&amp;#243;s a avalia&amp;#231;&amp;#227;o, suas demandas s&amp;#227;o registradas em formul&amp;#225;rios f&amp;#237;sicos. Dependendo da capacidade, o atendimento pode ser no mesmo dia ou o paciente entra em uma lista de espera. Para cada novo paciente atendido, um prontu&amp;#225;rio f&amp;#237;sico &amp;#233; criado e arquivado manualmente ao final da consulta.&#xA;&#xA;O problema central que o projeto busca resolver s&amp;#227;o os riscos e limita&amp;#231;&amp;#245;es decorrentes desse processo manual. O uso de planilhas compartilhadas &amp;#233; suscet&amp;#237;vel a erros de digita&amp;#231;&amp;#227;o, exclus&amp;#227;o acidental de dados e falta de controle de acesso. J&amp;#225; os formul&amp;#225;rios e prontu&amp;#225;rios f&amp;#237;sicos correm o risco de perda, danos e dificultam enormemente a consulta r&amp;#225;pida ao hist&amp;#243;rico do paciente. Este cen&amp;#225;rio afeta a efici&amp;#234;ncia dos alunos, a capacidade de supervis&amp;#227;o dos professores e a qualidade do registro administrativo da cl&amp;#237;nica.&#xA;&#xA;Uma boa solu&amp;#231;&amp;#227;o, como o CliniSys-Escola, ir&amp;#225; fornecer funcionalidades para digitalizar e integrar todo esse fluxo, incluindo: gest&amp;#227;o da fila de triagem, agendamento de consultas, prontu&amp;#225;rio eletr&amp;#244;nico do paciente e um m&amp;#243;dulo de gest&amp;#227;o acad&amp;#234;mica para vincular alunos e professores.&#xA;&#xA;&lt;b&gt;2.2. Descri&amp;#231;&amp;#227;o dos Usu&amp;#225;rios&lt;/b&gt;&#xA;&#xA;&lt;b&gt;Aluno &lt;/b&gt;(Aluno-Dentista):&#xA;&amp;nbsp;&#xA;&lt;ul&gt;&#xA;	&lt;li&gt;&lt;b&gt;Papel&lt;/b&gt;: Estudante de gradua&amp;#231;&amp;#227;o em odontologia cursando as disciplinas de pr&amp;#225;tica cl&amp;#237;nica.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Perfil&lt;/b&gt;: Faixa et&amp;#225;ria universit&amp;#225;ria, com conhecimento em inform&amp;#225;tica que varia de b&amp;#225;sico a intermedi&amp;#225;rio.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Responsabilidade&lt;/b&gt;: Realizar a triagem dos pacientes, registrar as demandas, abrir e preencher os prontu&amp;#225;rios eletr&amp;#244;nicos durante as consultas e visualizar a agenda de seus pacientes.&lt;/li&gt;&#xA;&lt;/ul&gt;&#xA;&#xA;&lt;b&gt;Professor Supervisor&lt;/b&gt;:&#xA;&amp;nbsp;&#xA;&lt;ul&gt;&#xA;	&lt;li&gt;&lt;b&gt;Papel&lt;/b&gt;: Docente respons&amp;#225;vel por orientar e supervisionar uma turma de alunos.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Perfil&lt;/b&gt;: Corpo docente da universidade, com forma&amp;#231;&amp;#227;o superior em Odontologia e familiaridade com sistemas digitais para fins acad&amp;#234;micos e administrativos.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Responsabilidade&lt;/b&gt;: Supervisionar os atendimentos, revisar e validar os registros feitos pelos alunos nos prontu&amp;#225;rios e acompanhar o desenvolvimento pr&amp;#225;tico da sua turma.&lt;/li&gt;&#xA;&lt;/ul&gt;&#xA;&#xA;&lt;b&gt;Recepcionista&lt;/b&gt;:&#xA;&amp;nbsp;&#xA;&lt;ul&gt;&#xA;	&lt;li&gt;&lt;b&gt;Papel&lt;/b&gt;: Funcion&amp;#225;rio administrativo respons&amp;#225;vel pelo primeiro contato com os pacientes na recep&amp;#231;&amp;#227;o da cl&amp;#237;nica.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Perfil&lt;/b&gt;: Corpo t&amp;#233;cnico-administrativo, com conhecimento em inform&amp;#225;tica focado em sistemas de cadastro e agendamento.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Responsabilidade&lt;/b&gt;: Cadastrar os pacientes que chegam, organiz&amp;#225;-los na fila de triagem e gerenciar o fluxo da sala de espera.&lt;/li&gt;&#xA;&lt;/ul&gt;&#xA;&#xA;&lt;b&gt;Administrador do Sistema&lt;/b&gt;:&#xA;&amp;nbsp;&#xA;&lt;ul&gt;&#xA;	&lt;li&gt;&lt;b&gt;Papel&lt;/b&gt;: Coordenador da cl&amp;#237;nica ou membro da equipe t&amp;#233;cnica designado.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Perfil&lt;/b&gt;: Usu&amp;#225;rio com conhecimento avan&amp;#231;ado do fluxo de trabalho da cl&amp;#237;nica e permiss&amp;#245;es para gerenciar o sistema.&lt;/li&gt;&#xA;	&lt;li&gt;&lt;b&gt;Responsabilidade&lt;/b&gt;: Gerenciar todas as contas de usu&amp;#225;rio, configurar turmas e disciplinas, e extrair relat&amp;#243;rios gerenciais para an&amp;#225;lise do desempenho da cl&amp;#237;nica.&lt;/li&gt;&#xA;&lt;/ul&gt;&#xA;&#xA;&lt;b&gt;2.3. Benef&amp;#237;cios&lt;/b&gt;&#xA;&#xA;&lt;b&gt;Centraliza&amp;#231;&amp;#227;o e Seguran&amp;#231;a da Informa&amp;#231;&amp;#227;o&lt;/b&gt;: Substituir planilhas vulner&amp;#225;veis e arquivos f&amp;#237;sicos por um banco de dados centralizado, garantindo a integridade e a seguran&amp;#231;a dos dados dos pacientes e prevenindo perdas de informa&amp;#231;&amp;#227;o.&#xA;&#xA;&lt;b&gt;Otimiza&amp;#231;&amp;#227;o do Fluxo de Atendimento&lt;/b&gt;: Agilizar o processo desde a chegada do paciente at&amp;#233; o atendimento, com filas de triagem digitais e acesso r&amp;#225;pido ao hist&amp;#243;rico, reduzindo o tempo de espera e aumentando a efici&amp;#234;ncia operacional.&#xA;&#xA;&lt;b&gt;Melhora no Acompanhamento Acad&amp;#234;mico e Cl&amp;#237;nico&lt;/b&gt;: Permitir que professores supervisores acessem e validem os procedimentos registrados pelos alunos de forma remota e instant&amp;#226;nea, melhorando a qualidade do ensino e do atendimento.&#xA;&#xA;&lt;b&gt;Apoio &amp;#224; Tomada de Decis&amp;#227;o&lt;/b&gt;: Fornecer dados estruturados que possibilitem a gera&amp;#231;&amp;#227;o de relat&amp;#243;rios simples sobre o volume de atendimentos, tipos de procedimentos e desempenho dos alunos, auxiliando na gest&amp;#227;o da cl&amp;#237;nica-escola.&#xA;&#xA;&lt;b&gt;Redu&amp;#231;&amp;#227;o de Custos e Espa&amp;#231;o F&amp;#237;sico&lt;/b&gt;: Eliminar a necessidade de impress&amp;#227;o de formul&amp;#225;rios e de espa&amp;#231;o para arquivamento de prontu&amp;#225;rios f&amp;#237;sicos, resultando em economia de recursos.&#xA;&#xA;&lt;b&gt;2.4. Limita&amp;#231;&amp;#245;es e Restri&amp;#231;&amp;#245;es&lt;/b&gt;&#xA;&amp;nbsp;&#xA;&lt;ul&gt;&#xA;	&lt;li&gt;O sistema n&amp;#227;o far&amp;#225; a gest&amp;#227;o financeira, como controle de faturamento, fluxo de caixa ou cobran&amp;#231;a de pacientes.&lt;/li&gt;&#xA;	&lt;li&gt;O sistema n&amp;#227;o incluir&amp;#225; um m&amp;#243;dulo de controle de estoque de materiais e insumos odontol&amp;#243;gicos.&lt;/li&gt;&#xA;	&lt;li&gt;O sistema n&amp;#227;o ter&amp;#225; integra&amp;#231;&amp;#227;o direta com sistemas externos, como o do Sistema &amp;#218;nico de Sa&amp;#250;de (SUS) ou de laborat&amp;#243;rios de pr&amp;#243;tese/radiologia.&lt;/li&gt;&#xA;	&lt;li&gt;O sistema n&amp;#227;o abranger&amp;#225; funcionalidades de gest&amp;#227;o de recursos humanos, como folha de pagamento ou controle de ponto dos funcion&amp;#225;rios.&lt;/li&gt;&#xA;&lt;/ul&gt;"/><UML:TaggedValue tag="parent" value="EAPK_8C7CBDC4_6F83_41c5_B60B_9AC35DA86C25"/><UML:TaggedValue tag="ea_package_id" value="4"/><UML:TaggedValue tag="created" value="2019-02-28 00:00:00"/><UML:TaggedValue tag="modified" value="2025-08-24 13:53:38"/><UML:TaggedValue tag="iscontrolled" value="TRUE"/><UML:TaggedValue tag="xmlpath" value="eaC\C482772111B6.xml"/><UML:TaggedValue tag="version" value="1.0"/><UML:TaggedValue tag="isprotected" value="FALSE"/><UML:TaggedValue tag="usedtd" value="FALSE"/><UML:TaggedValue tag="logxml" value="FALSE"/><UML:TaggedValue tag="tpos" value="3"/><UML:TaggedValue tag="packageFlags" value="isModel=1;VCCFG=Git_CliniSys_UFSC;CRC=0;"/><UML:TaggedValue tag="phase" value="1.0"/><UML:TaggedValue tag="status" value="Proposed"/><UML:TaggedValue tag="author" value="Fabiane"/><UML:TaggedValue tag="complexity" value="1"/><UML:TaggedValue tag="ea_stype" value="Public"/><UML:TaggedValue tag="tpos" value="3"/><UML:TaggedValue tag="gentype" value="Java"/><UML:TaggedValue tag="object_style" value="MDoc=1;"/><UML:TaggedValue tag="modeldocument"/></UML:ModelElement.taggedValue><UML:Namespace.ownedElement/></UML:Package></UML:Namespace.ownedElement></UML:Model></XMI.content><XMI.difference/><XMI.extensions xmi.extender="Enterprise Architect 2.5"/></XMI>
