<?xml version="1.0" encoding="windows-1252"?>
<XMI xmi.version="1.1" xmlns:UML="omg.org/UML1.3">
	<XMI.header><XMI.documentation><XMI.exporter>Enterprise Architect</XMI.exporter><XMI.exporterVersion>2.5</XMI.exporterVersion></XMI.documentation></XMI.header><XMI.content><UML:Model name="EA Model" xmi.id="MX_EAID_CB6DB601_1254_4f6b_8FC3_9BCC8F1A766E"><UML:Namespace.ownedElement><UML:Class name="EARootClass" xmi.id="EAID_11111111_5487_4080_A7F4_41526CB0AA00" isRoot="true" isLeaf="false" isAbstract="false"/><UML:Package name="1. Introdução" xmi.id="EAPK_CB6DB601_1254_4f6b_8FC3_9BCC8F1A766E" isRoot="false" isLeaf="false" isAbstract="false" visibility="public"><UML:ModelElement.taggedValue><UML:TaggedValue tag="documentation" value="&lt;b&gt;1.1. Finalidade do Documento&lt;/b&gt;&#xA;Este documento tem como objetivo apresentar o escopo do sistema CliniSys-Escola, estabelecendo seus requisitos, funcionalidades e as informa&amp;#231;&amp;#245;es necess&amp;#225;rias para sua implementa&amp;#231;&amp;#227;o. Ele servir&amp;#225; como um guia para a equipe de desenvolvimento, alinhando expectativas e orientando a entrega das funcionalidades previstas para atender &amp;#224;s necessidades de gest&amp;#227;o de uma cl&amp;#237;nica-escola de odontologia.&#xA;&#xA;O sistema visa substituir o fluxo de trabalho atual, que depende de planilhas eletr&amp;#244;nicas compartilhadas e formul&amp;#225;rios f&amp;#237;sicos, mitigando os riscos e limita&amp;#231;&amp;#245;es inerentes a esses processos manuais.&#xA;&#xA;&lt;b&gt;1.2. Escopo do Projeto&lt;/b&gt;&#xA;O CliniSys-Escola &amp;#233; concebido como um ecossistema de software multiplataforma, projetado para otimizar a gest&amp;#227;o da cl&amp;#237;nica-escola de odontologia fisct&amp;#237;cia. A solu&amp;#231;&amp;#227;o ser&amp;#225; composta por uma aplica&amp;#231;&amp;#227;o de desktop e uma aplica&amp;#231;&amp;#227;o m&amp;#243;vel, ambas sincronizadas atrav&amp;#233;s de um servi&amp;#231;o de backend central, por&amp;#233;m, visto o prazo curto, ser&amp;#225; feito somente a aplica&amp;#231;&amp;#227;o desktop. O sistema visa controlar o fluxo de atendimentos realizados por alunos sob supervis&amp;#227;o de professores, centralizando informa&amp;#231;&amp;#245;es de pacientes, agendamentos e prontu&amp;#225;rios em um ambiente digital seguro e eficiente.&#xA;&#xA;&lt;b&gt;Funcionalidades Inclusas (In-Scope):&lt;/b&gt;&#xA;&#xA;O escopo do desenvolvimento abranger&amp;#225; as seguintes funcionalidades essenciais:&#xA;&#xA;Gest&amp;#227;o de Perfis de Usu&amp;#225;rios: Gerenciamento de contas para os perfis de acesso (Administrador, Recepcionista, Aluno, Professor Supervisor).&#xA;&#xA;Cadastro e Gerenciamento de Pacientes: Manuten&amp;#231;&amp;#227;o de um registro central de pacientes da comunidade, incluindo dados demogr&amp;#225;ficos e de contato.&#xA;&#xA;Controle de Triagem e Lista de Espera: Digitaliza&amp;#231;&amp;#227;o do processo de triagem, permitindo o registro de demandas do paciente e o gerenciamento de uma lista de espera centralizada.&#xA;&#xA;Agendamento de Consultas: M&amp;#243;dulo para marca&amp;#231;&amp;#227;o, remarca&amp;#231;&amp;#227;o e cancelamento de consultas, com dados sincronizados em tempo real entre as plataformas.&#xA;&#xA;Gest&amp;#227;o de Prontu&amp;#225;rio Eletr&amp;#244;nico: Funcionalidade para que alunos, sob supervis&amp;#227;o, registrem todos os procedimentos realizados, com o hist&amp;#243;rico do paciente acess&amp;#237;vel digitalmente.&#xA;&#xA;Gerenciamento Acad&amp;#234;mico: Cadastro de alunos, professores e sua associa&amp;#231;&amp;#227;o com as disciplinas de pr&amp;#225;tica cl&amp;#237;nica (Cl&amp;#237;nica I, II e III).&#xA;&#xA;&lt;b&gt;Funcionalidades Exclu&amp;#237;das (Out-of-Scope):&lt;/b&gt;&#xA;&#xA;Para garantir a viabilidade do projeto, as seguintes funcionalidades s&amp;#227;o declaradas fora do escopo:&#xA;&#xA;M&amp;#243;dulos financeiros complexos, como faturamento ou cobran&amp;#231;a.&#xA;&#xA;Controle de estoque de materiais e insumos odontol&amp;#243;gicos.&#xA;&#xA;Integra&amp;#231;&amp;#227;o com o Sistema &amp;#218;nico de Sa&amp;#250;de (SUS) ou sistemas de laborat&amp;#243;rios externos.&#xA;&#xA;Funcionalidades de gest&amp;#227;o de recursos humanos ou folha de pagamento.&#xA;&#xA;&lt;b&gt;1.3. Vis&amp;#227;o Geral do Documento&lt;/b&gt;&#xA;Este documento est&amp;#225; estruturado para guiar o leitor desde a compreens&amp;#227;o de alto n&amp;#237;vel do sistema at&amp;#233; os detalhes t&amp;#233;cnicos de sua concep&amp;#231;&amp;#227;o. A Se&amp;#231;&amp;#227;o 2 oferece uma descri&amp;#231;&amp;#227;o geral do CliniSys-Escola. A Se&amp;#231;&amp;#227;o 3 detalha os requisitos espec&amp;#237;ficos. A Se&amp;#231;&amp;#227;o 4 apresenta um modelo de dom&amp;#237;nio preliminar. Finalmente, a Se&amp;#231;&amp;#227;o 5 fornece uma an&amp;#225;lise aprofundada das tecnologias escolhidas para a arquitetura cliente-servidor."/><UML:TaggedValue tag="parent" value="EAPK_8C7CBDC4_6F83_41c5_B60B_9AC35DA86C25"/><UML:TaggedValue tag="ea_package_id" value="3"/><UML:TaggedValue tag="created" value="2019-02-28 00:00:00"/><UML:TaggedValue tag="modified" value="2025-08-24 13:30:57"/><UML:TaggedValue tag="iscontrolled" value="TRUE"/><UML:TaggedValue tag="xmlpath" value="ea9\9BCC8F1A766E.xml"/><UML:TaggedValue tag="version" value="1.0"/><UML:TaggedValue tag="isprotected" value="FALSE"/><UML:TaggedValue tag="usedtd" value="FALSE"/><UML:TaggedValue tag="logxml" value="FALSE"/><UML:TaggedValue tag="tpos" value="2"/><UML:TaggedValue tag="packageFlags" value="isModel=1;VCCFG=Git_CliniSys_UFSC;CRC=0;"/><UML:TaggedValue tag="phase" value="1.0"/><UML:TaggedValue tag="status" value="Proposed"/><UML:TaggedValue tag="author" value="Fabiane"/><UML:TaggedValue tag="complexity" value="1"/><UML:TaggedValue tag="ea_stype" value="Public"/><UML:TaggedValue tag="tpos" value="2"/><UML:TaggedValue tag="gentype" value="Java"/></UML:ModelElement.taggedValue><UML:Namespace.ownedElement/></UML:Package></UML:Namespace.ownedElement></UML:Model></XMI.content><XMI.difference/><XMI.extensions xmi.extender="Enterprise Architect 2.5"/></XMI>
